<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <title>hack.lu 2019 | xrivendell7</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
  <meta name="description" content=".xlowhwmrdrbu{zoom:80%;}  babykernel2直接给了AAW和AAR Each process has a struct called task_struct which is stored in kernel space, this structure contains a lot of information related to the process like">
<meta property="og:type" content="article">
<meta property="og:title" content="hack.lu 2019">
<meta property="og:url" content="http://example.com/2019/11/09/2019hacklu/index.html">
<meta property="og:site_name" content="xrivendell7">
<meta property="og:description" content=".xlowhwmrdrbu{zoom:80%;}  babykernel2直接给了AAW和AAR Each process has a struct called task_struct which is stored in kernel space, this structure contains a lot of information related to the process like">
<meta property="og:locale" content="en_US">
<meta property="og:image" content="http://example.com/2019/11/09/2019hacklu/image-20251122133227303.png">
<meta property="article:published_time" content="2019-11-09T03:07:10.000Z">
<meta property="article:modified_time" content="2025-11-22T05:32:33.672Z">
<meta property="article:author" content="xrivendell7">
<meta name="twitter:card" content="summary">
<meta name="twitter:image" content="http://example.com/2019/11/09/2019hacklu/image-20251122133227303.png">
  

        <section id="main"><article id="post-2019hacklu" class="h-entry article article-type-post" itemprop="blogPost" itemscope itemtype="https://schema.org/BlogPosting">
  <div class="article-meta">
    <a href="/2019/11/09/2019hacklu/" class="article-date">
  <time class="dt-published" datetime="2019-11-09T03:07:10.000Z" itemprop="datePublished">2019-11-09</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="p-name article-title" itemprop="headline name">
      hack.lu 2019
    </h1>
  

      </header>
    
    <div class="e-content article-entry" itemprop="articleBody">
      
        <style>.xlowhwmrdrbu{zoom:80%;}</style><img src="/2019/11/09/2019hacklu/image-20251122133227303.png" class="xlowhwmrdrbu" alt="image-20251122133227303">

<h2 id="babykernel2"><a href="#babykernel2" class="headerlink" title="babykernel2"></a>babykernel2</h2><p>直接给了AAW和AAR</p>
<p>Each process has a struct called task_struct which is stored in kernel space, this structure contains a lot of information related to the process like scheduling information, memory descriptor(mm_struct) which has information about programs memory, parent process, linked list of child process, next task and more importantly it has a pointer to process privileges which is a structure named cred. So our task is to overwrite the identifiers( uid, gid, group id, fsuid, fsgid) to 0 which is nothing but a process with root privileges.</p>
<ol>
<li>Read <code>current_task</code> ptr address based on provided <code>System.map</code></li>
<li>Get <code>cred* cred</code> pointer</li>
<li>Overwrite <code>cred-&gt;fsuid</code> and <code>cred-&gt;fsguid</code></li>
<li>Read <code>/flag</code></li>
</ol>
<figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br></pre></td><td class="code"><pre><span class="line"> ptype /o struct cred</span><br><span class="line">/* offset    |  size */  <span class="built_in">type</span> = struct cred &#123;</span><br><span class="line">/*    0      |     4 */    atomic_t usage;</span><br><span class="line">/*    4      |     4 */    kuid_t uid;</span><br><span class="line">/*    8      |     4 */    kgid_t gid;</span><br><span class="line">/*   12      |     4 */    kuid_t suid;</span><br><span class="line">/*   16      |     4 */    kgid_t sgid;</span><br><span class="line">/*   20      |     4 */    kuid_t euid;</span><br><span class="line">/*   24      |     4 */    kgid_t egid;</span><br><span class="line">/*   28      |     4 */    kuid_t fsuid;</span><br><span class="line">/*   32      |     4 */    kgid_t fsgid;</span><br><span class="line">/*   36      |     4 */    unsigned int securebits;</span><br><span class="line">/*   40      |     8 */    kernel_cap_t cap_inheritable;</span><br><span class="line">/*   48      |     8 */    kernel_cap_t cap_permitted;</span><br><span class="line">/*   56      |     8 */    kernel_cap_t cap_effective;</span><br><span class="line">/*   64      |     8 */    kernel_cap_t cap_bset;</span><br><span class="line">/*   72      |     8 */    kernel_cap_t cap_ambient;</span><br><span class="line">/*   80      |     8 */    struct user_struct *user;</span><br><span class="line">/*   88      |     8 */    struct user_namespace *user_ns;</span><br><span class="line">/*   96      |     8 */    struct group_info *group_info;</span><br><span class="line">/*  104      |    16 */    union &#123;</span><br><span class="line">/*                 4 */        int non_rcu;</span><br><span class="line">/*                16 */        struct callback_head &#123;</span><br><span class="line">/*  104      |     8 */            struct callback_head *next;</span><br><span class="line">/*  112      |     8 */            void (*func)(struct callback_head *);</span><br><span class="line"></span><br><span class="line">                                   /* total size (bytes):   16 */</span><br><span class="line">                               &#125; rcu;</span><br><span class="line"></span><br><span class="line">                               /* total size (bytes):   16 */</span><br><span class="line">                           &#125;;</span><br><span class="line"></span><br><span class="line">                           /* total size (bytes):  120 */</span><br><span class="line">                         &#125;</span><br></pre></td></tr></table></figure>



<p>可以通过<code>init_task</code>也就是0号进程的前向task_list指针找到<code>current_task</code>，可以通过泄露<code>comm</code>进程名来确定</p>
<p>因为通过Ctrl+C在gdb中断下的是在Init的swapper，即0号进程，通过tasks指针来找到最后一个运行的进程</p>
<figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">gef&gt; p current_task.tasks</span><br><span class="line"><span class="variable">$18</span> = &#123;</span><br><span class="line">  next = 0xffff888000028210,</span><br><span class="line">  prev = 0xffff888003375990</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>

<p>当然应该最简单的是通过<code>current_task</code>来，在运行的client_kernel.ko中下断，此时内核的current_task即为当前进程并查看cred如下：</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br></pre></td><td class="code"><pre><span class="line">gef&gt; p current_task</span><br><span class="line">$<span class="number">32</span> = (<span class="keyword">struct</span> task_struct *) <span class="number">0xffff888003373480</span></span><br><span class="line">gef&gt; p $<span class="number">32.</span>comm</span><br><span class="line">$<span class="number">33</span> =   <span class="string">&quot;client_kernel_b&quot;</span></span><br><span class="line">gef&gt; p $<span class="number">32.</span>cred</span><br><span class="line">$<span class="number">34</span> = (<span class="type">const</span> <span class="keyword">struct</span> cred *) <span class="number">0xffff888003384700</span></span><br><span class="line">gef&gt; p *$<span class="number">34</span></span><br><span class="line">$<span class="number">35</span> = &#123;</span><br><span class="line">  usage = &#123;</span><br><span class="line">    counter = <span class="number">0x3</span></span><br><span class="line">  &#125;,</span><br><span class="line">  uid = &#123;</span><br><span class="line">    val = <span class="number">0x3e8</span></span><br><span class="line">  &#125;,</span><br><span class="line">  gid = &#123;</span><br><span class="line">    val = <span class="number">0x3e8</span></span><br><span class="line">  &#125;,</span><br><span class="line">  suid = &#123;</span><br><span class="line">    val = <span class="number">0x3e8</span></span><br><span class="line">  &#125;,</span><br><span class="line">  sgid = &#123;</span><br><span class="line">    val = <span class="number">0x3e8</span></span><br><span class="line">  &#125;,</span><br><span class="line">  euid = &#123;</span><br><span class="line">    val = <span class="number">0x3e8</span></span><br><span class="line">  &#125;,</span><br><span class="line">  egid = &#123;</span><br><span class="line">    val = <span class="number">0x3e8</span></span><br><span class="line">  &#125;,</span><br><span class="line">  fsuid = &#123;</span><br><span class="line">    val = <span class="number">0x3e8</span></span><br><span class="line">  &#125;,</span><br><span class="line">  fsgid = &#123;</span><br><span class="line">    val = <span class="number">0x3e8</span></span><br><span class="line">  &#125;,</span><br><span class="line">  securebits = <span class="number">0x0</span>,</span><br><span class="line">  cap_inheritable = &#123;</span><br><span class="line">    cap =       &#123;[<span class="number">0x0</span>] = <span class="number">0x0</span>,</span><br><span class="line">          [<span class="number">0x1</span>] = <span class="number">0x0</span>&#125;</span><br><span class="line">  &#125;,</span><br><span class="line">  cap_permitted = &#123;</span><br><span class="line">    cap =       &#123;[<span class="number">0x0</span>] = <span class="number">0x0</span>,</span><br><span class="line">      [<span class="number">0x1</span>] = <span class="number">0x0</span>&#125;</span><br><span class="line">  &#125;,</span><br><span class="line">  cap_effective = &#123;</span><br><span class="line">    cap =       &#123;[<span class="number">0x0</span>] = <span class="number">0x0</span>,</span><br><span class="line">      [<span class="number">0x1</span>] = <span class="number">0x0</span>&#125;</span><br><span class="line">  &#125;,</span><br><span class="line">  cap_bset = &#123;</span><br><span class="line">    cap =       &#123;[<span class="number">0x0</span>] = <span class="number">0xffffffff</span>,</span><br><span class="line">      [<span class="number">0x1</span>] = <span class="number">0x3f</span>&#125;</span><br><span class="line">  &#125;,</span><br><span class="line">  cap_ambient = &#123;</span><br><span class="line">    cap =       &#123;[<span class="number">0x0</span>] = <span class="number">0x0</span>,</span><br><span class="line">      [<span class="number">0x1</span>] = <span class="number">0x0</span>&#125;</span><br><span class="line">  &#125;,</span><br><span class="line">  user = <span class="number">0xffff888003380000</span>,</span><br><span class="line">  user_ns = <span class="number">0xffffffff8183e5c0</span> &lt;init_user_ns&gt;,</span><br><span class="line">  group_info = <span class="number">0xffff88800018d2c0</span>,</span><br><span class="line">  &#123;</span><br><span class="line">    non_rcu = <span class="number">0x0</span>,</span><br><span class="line">    rcu = &#123;</span><br><span class="line">      next = <span class="number">0x0</span>,</span><br><span class="line">      func = <span class="number">0x0</span></span><br><span class="line">    &#125;</span><br><span class="line">  &#125;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>

<p>可见cred的数据结构：</p>
<figure class="highlight c"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br></pre></td><td class="code"><pre><span class="line">gef&gt; ptype <span class="class"><span class="keyword">struct</span> <span class="title">cred</span></span></span><br><span class="line"><span class="class"><span class="title">type</span> =</span> <span class="class"><span class="keyword">struct</span> <span class="title">cred</span> &#123;</span></span><br><span class="line">    <span class="type">atomic_t</span> usage;</span><br><span class="line">    <span class="type">kuid_t</span> uid;</span><br><span class="line">    <span class="type">kgid_t</span> gid;</span><br><span class="line">    <span class="type">kuid_t</span> suid;</span><br><span class="line">    <span class="type">kgid_t</span> sgid;</span><br><span class="line">    <span class="type">kuid_t</span> euid;</span><br><span class="line">    <span class="type">kgid_t</span> egid;</span><br><span class="line">    <span class="type">kuid_t</span> fsuid;</span><br><span class="line">    <span class="type">kgid_t</span> fsgid;</span><br><span class="line">    <span class="type">unsigned</span> <span class="type">int</span> securebits;</span><br><span class="line">    <span class="type">kernel_cap_t</span> cap_inheritable;</span><br><span class="line">    <span class="type">kernel_cap_t</span> cap_permitted;</span><br><span class="line">    <span class="type">kernel_cap_t</span> cap_effective;</span><br><span class="line">    <span class="type">kernel_cap_t</span> cap_bset;</span><br><span class="line">    <span class="type">kernel_cap_t</span> cap_ambient;</span><br><span class="line">    <span class="class"><span class="keyword">struct</span> <span class="title">user_struct</span> *<span class="title">user</span>;</span></span><br><span class="line">    <span class="class"><span class="keyword">struct</span> <span class="title">user_namespace</span> *<span class="title">user_ns</span>;</span></span><br><span class="line">    <span class="class"><span class="keyword">struct</span> <span class="title">group_info</span> *<span class="title">group_info</span>;</span></span><br><span class="line">    <span class="class"><span class="keyword">union</span> &#123;</span></span><br><span class="line">        <span class="type">int</span> non_rcu;</span><br><span class="line">        <span class="class"><span class="keyword">struct</span> <span class="title">callback_head</span> <span class="title">rcu</span>;</span></span><br><span class="line">    &#125;;</span><br><span class="line">&#125;</span><br><span class="line">gef&gt; ptype /o <span class="class"><span class="keyword">struct</span> <span class="title">cred</span></span></span><br><span class="line"><span class="class">/* <span class="title">offset</span>    |  <span class="title">size</span> */  <span class="title">type</span> =</span> <span class="class"><span class="keyword">struct</span> <span class="title">cred</span> &#123;</span></span><br><span class="line"><span class="comment">/*    0      |     4 */</span>    <span class="type">atomic_t</span> usage;</span><br><span class="line"><span class="comment">/*    4      |     4 */</span>    <span class="type">kuid_t</span> uid;</span><br><span class="line"><span class="comment">/*    8      |     4 */</span>    <span class="type">kgid_t</span> gid;</span><br><span class="line"><span class="comment">/*   12      |     4 */</span>    <span class="type">kuid_t</span> suid;</span><br><span class="line"><span class="comment">/*   16      |     4 */</span>    <span class="type">kgid_t</span> sgid;</span><br><span class="line"><span class="comment">/*   20      |     4 */</span>    <span class="type">kuid_t</span> euid;</span><br><span class="line"><span class="comment">/*   24      |     4 */</span>    <span class="type">kgid_t</span> egid;</span><br><span class="line"><span class="comment">/*   28      |     4 */</span>    <span class="type">kuid_t</span> fsuid;</span><br><span class="line"><span class="comment">/*   32      |     4 */</span>    <span class="type">kgid_t</span> fsgid;</span><br></pre></td></tr></table></figure>

<p>就根据offset从4byte-20bytes都更改为0，即可实现改进程的提权</p>
